---
kind: method
id: M:Autodesk.Revit.DB.MullionTypeSet.ReverseIterator
source: html/8c38f967-8428-9a87-d4b4-160d23fe767c.htm
---
# Autodesk.Revit.DB.MullionTypeSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual MullionTypeSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.